{"examples":[{"id": 783, "text": "(c)mrbwill pay undisputed amounts within 30 days after receiving Supplier's invoice.", "meta": {}, "annotation_approver": null, "labels": [[41, 48, "Payment Term"]]},
{"id": 784, "text": "MSA Tech Services (9/06}CONFIDENTIAL INFORMATION Supplier must not invoice mrb more than 90 calendar days after Supplier is permitted to issue an invoiceunderthis Agreement(“Late Invoices”)orinitially raise a claim for paymentof a previously issued invoice morethan 6 monthsafter the invoice date (“Late Claims’).", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 785, "text": "Supplier will immediately, but in no event more than 10business days after discovery of an over-billing, reimburse mrbfor any over-billing disclosed by the audit andsimple interest for the period oftime between the date the overpayment was made and the date that mrb wasreimbursedat a rate of 1% per month.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 786, "text": "Block will pay the Commission Fees due per the Report alongwith the submission of the Report, except that if Block retains a third party to process andissue payments for Block, such payments will be made by such third party within thirty(30) days after delivery of the Report, and in such case Company will notify Block ifCompany does not receive payment within thirty (30) days after receipt of the Report.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 787, "text": "Payment for services rendered under this Agreement shall be madewithin thirty (30) days following receipt of Magill invoices.", "meta": {}, "annotation_approver": null, "labels": [[71, 87, "Payment Term"]]},
{"id": 788, "text": "The Total Fees shall be due upon the Order Form Effective Date, and Customer must pay such feesaccordingto the following payment schedule:(a) the Total Fees shall be invoiced annually thirty (30) days in advance of each such year of the Subscription Term (excludingthe first invoice which shall be invoiced upon execution of this Order Form)as follows:Year 1 — $300,000.00Year2 - $315,000.00Year 3 - $330,000.00Customer shall pay each invoice within thirty (30) days of the invoice date.", "meta": {}, "annotation_approver": null, "labels": [[184, 200, "Payment Term"]]},
{"id": 789, "text": "The renewal fees for each Renewal Term shall be due on the first day of the RenewalTerm and payable “netthirty (30) days” from the date of invoice.", "meta": {}, "annotation_approver": null, "labels": [[100, 121, "Payment Term"]]},
{"id": 790, "text": "If applicable for purposes of performing the Enablement Services, or Consulting Services purchased underthisOrder Form, Customer agrees to pay Ariba all reasonable out-of-pocket expenses incurred in connection with the AribaOnDemandSolution Packageoffering including withoutlimitation:(i) travel expenses including airfare and car rental and traveltime in excess of four (4) hours per week;(ii) living expenses including hotels; (iii) meal expensesincluding breakfast, lunch,and dinner; and(iv) translation and/or interpretation services.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 791, "text": "mrbshall pay all invoices within thirty (30)days from the invoice date.", "meta": {}, "annotation_approver": null, "labels": [[33, 48, "Payment Term"]]},
{"id": 792, "text": "With respect to recurring Services,Fiberlink shall invoice Customer on a monthly basis and paymentshall be due net 30 days following the date of invoice inUS.", "meta": {}, "annotation_approver": null, "labels": [[115, 122, "Payment Term"]]},
{"id": 793, "text": "If paymentof any undisputed amounts is not receivedwithin 30 days, Fiberlink may suspend its performance under this Agreement, after providing customer 10 days writtennotice of such non-payment, until Customer curesits default and posts such reasonable security as required by Fiberlink, orFiberlink may terminate this Agreement pursuant to paragraph 5.3.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 794, "text": "Commencing in month four and continuing for the remainder of the Term,Fiberlink shall invoice Customer, and Customer shall pay, for the Services based on Customer’s actualusage at the rates set forth in this Agreementat the end of Month 3 of the Term of the Agreement (the\"Monthly Minimum Commitment\") for all operationalcircuits listed in Exhibit D, which is attached heretoand madepart hereof, or actual usage charges, whichever is greater.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 795, "text": ":¥4y5recall>rhinoPenne!wilensSehocespecyengage (whether as an employee, consultant or independent Subcontractor) any ProtectedPersonduring the Non-Solicitation Period, the violating party shall pay to the other ekfy Oovent (50%)fifty percent (50%) of such employeesfirst twelve (12) months of salary or( ) i 5PpCokeof gross payments forthe first twelve (12) months services provided to the violating partybyProtected Personnel.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 796, "text": "Installment payments are due and payable thirty (30) days following Client’sacceptance of the Deliverables or as otherwise detailed in the SOW, and expense reimbursements are due thirty (30) daysafter a conforming invoice from USTis received by Client.", "meta": {}, "annotation_approver": null, "labels": [[41, 57, "Payment Term"]]},
{"id": 797, "text": "UST may cease work on a Project if an undisputed installmentpayment or undisputed expense reimbursement is not made within ten (10) days of its due date as long as, on or after thetenth (10\") day after payment is due, UST provides at least ten (10) business days notice ofits intention to cease Service inorder to allow Client an opportunity to make payment and prevent cessation of Service , and provided further that UST shallhavenoright to terminate a SOW or this Agreement for a delayed payment except as specified in Section 10 of thisAgreement.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 798, "text": "If Client has not cured such delayed payment on the twelfth (12) day following written notice, UST shall beentitled to cease Service and withhold any subsequent Deliverables on such Project until paymentis received.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 799, "text": "Each invoice will be payable in accordance with theillspecifyhow invoices will be~are ow ost soneinterest in the amount of one percent (1 %) per month on anyprovisions in Section 5.1.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 800, "text": "|EXCEPT WITH RESPECT TO A PARTY’S CONFIDENTIALITY OBLIGATIONS HEREUNDER ANDEXCEPT WITH RESPECT TO AMOUNTS PAYABLE IN CONNECTION WITH A PARTY'S INDEMNIFICATIONOBLIGATIONS HEREUNDER, (A) NEITHER PARTY’S LIABILITY FOR DAMAGES HEREUNDER, REGARDLESSOF THE FORM OF ACTION, SHALL EXCEED PER CLAIM ANDIN THE AGGREGATE THE TOTAL AMOUNTPAID FOR SERVICES IN THE PRECEDING TWELVE (12) MONTHS UNDERTHE SPECIFIC SOW GIVING RISE TOTHE LIABILITY.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 801, "text": "If this occurs during the Term, SBC will compute thetermination charges accordingto the following formula and rendera bill to Customer, which Customer agreesto pay within 30 days:Long Distance Service / PRI:*®100% of any waived Non Recurring Charges, Credits and Rebates.", "meta": {}, "annotation_approver": null, "labels": [[171, 178, "Payment Term"]]},
{"id": 802, "text": "FEE SCHEDULE *                  Total Loan    Amount    FINANCE    Repayment  ANNUAL       Amount  Financed   CHARGE     Period    PERCENTAGE                 RATE (APR)       $500  $494.65  $5.35   11 days    35.89%      $750   $741.97  $8.03   11 days    35.91%      $1500  $1462.00  $38.00   11 days    86.25%      $2000  $1950.00 $50.00   11 days    85.08%      $3000  $2925.00 $75.00   11 days    85.08%      $7500  $7405.00 $95.00   11 days      42.57%   *The representative ranges of loan amounts, corresponding finance charges and estimated APRs do not reflect other fees and charges you have authorized SBBT to deduct from the amount of the RAL, including the tax reparer’s fees (see itemization below) or other loan products (if applicable).", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 803, "text": "The costs for your RAL would be as follows: (a) Finance Charge         $____________ (b) Preparer’s Electronic Filing Fee       $____________ (c) Preparer’s Tax Preparation Fee        $____________ (d) Total of all Charges and Fees ((a)+(b)+(c))      $____________* (e)   Estimated Annual Percentage Rate (“APR”) of the RAL using repayment term of 11 days    ___________%  * These fees do not include SBBT’s account-handling fee of $30.95 that is charged on all products.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 804, "text": "Fees and Expensesa) Prime will pay Subcontractor within 30 days of the invoice, its hourly fees or fixed fees at the rates stated, or the fixed price stated, in the relevant SOW.", "meta": {}, "annotation_approver": null, "labels": [[56, 63, "Payment Term"]]},
{"id": 805, "text": "Subcontractor shall have the right to suspend or terminate entirely the Services under an SOW if payment is not received within 30 days.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 806, "text": "Notwithstanding the preceding paragraph, in the event of Customer’s termination for convenience, Customer shall pay to MetricStream the termination fee for such Cloud Services in accordance with the following:Specified Termination DateTermination FeePrior to First anniversary of the Effective DateSum of the six (6) previous months invoicesAfter First anniversary but prior to Second anniversary date of the Effective DateSum of the five (5) previous months invoicesAfter Second anniversary date but prior to Third anniversary date of the Effective DateSum of the four (4) previous months invoicesMetricStream Application Service Provider AgreementPage 2 of 31DocuSign Envelope ID: 01455F74-C71B-43A6-B816-58FBCF4B64963.3 Termination for Cause.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 807, "text": "All such payments shall be made by Customer within thirty (30) days of any termination of this Agreement.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 808, "text": "Customer will pay MetricStream in U.S. dollars within 30 days (Net 30 terms) of receipt of a correct invoice all undisputed charges and promptly notify MetricStream in writing of any disputed amount.", "meta": {}, "annotation_approver": null, "labels": [[54, 61, "Payment Term"]]},
{"id": 809, "text": "5 Paym ent of service credits5.1 The Supplier shall apply the Service Credits to the next Charges payable following the month to which they relate except if the Services are terminated pursuant to the terms of the Agreement, in which event the Supplier will pay Mazars any outstanding Service Credits within thirty (30) days of the effective date of termination of the Services.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 810, "text": "5.3 All invoices are payable within 30 days from the date of invoice.", "meta": {}, "annotation_approver": null, "labels": [[36, 43, "Payment Term"]]},
{"id": 811, "text": "13.2 If the Owner or the Licensee, as the case may be, fails to pay an invoice addressed to it for services under this Agreement within 30 days of its issue, NCC Group reserves the right to give that party written notice to pay the outstanding invoice within 30 days.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 812, "text": "2 G uarantee2.1 In consideration for Mazars entering into the Agreement with MetricStream, the Guarantor irrevocably and unconditionally guarantees as primary obligor, and not merely as surety:(a) to pay to Mazars on written demand, and in the currency in which the same falls due for payment, within thirty (30) days become due or owing by MetricStream to Mazars under or in connection with the Agreement; and/or(b) the due and punctual performance by MetricStream of each and all of the obligations, representations, warranties, duties and undertakings of MetricStream under and pursuant to the Agreement when and if the same is due for performance in accordance with the Agreement but only in the event that MetricStream shall in any respect commit any breach of or fail to comply with any such obligations, in which case the Guarantor will forthwith remedy such breach and fulfil such obligation (including any obligation to reimburse or indemnify Mazars) in place of MetricStream.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 813, "text": "7.2 If at any time the Guarantor is required by law to make any deduction or withholding in respect of any taxes, duties or other charges or withholdings from any payment due under this Deed, the sum due from the Guarantor in respect of such payment shall be increased to the extent necessary to ensure that, after the making of such deduction or withholding, Mazars receives on the due date and retains (free of anyPage 87 of 111liability in respect of such deduction or withholding) a net sum equal to the sum which it would have received had no such deduction or withholding been required to be made.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 814, "text": "MetricStream is a trademark of MetricStream, Inc. http.y/www.metricstreamPage iPage 96 of 111Table of Contents1 Project Overview............................................................................................................................1.1 Project Description....................................................................................................................1.2 Project Scope............................................................................................................................1.3 Project Documentation.............................................................................................................2 Project Assumptions.....................................................................................................................3 Project Details...............................................................................................................................3.1 Project Approach......................................................................................................................3.2 Project Timeline........................................................................................................................3.3 Resources..................................................................................................................................3.4 Project Activities and Deliverables...........................................................................................3.4.1 Detailed Requirements Analysis and Project Planning Phase (Phase 0).........84 Commercial Terms......................................................................................................................................104.1 Payment Terms................................................................................................................................... 104.2 ACCEPTANCE CRITERIA.................................................................................................................. 104.3 Payment Schedule.............................................................................................................................. 115 Communication Plans................................................................................................................................ 125.1 Weekly Meetings................................................................................................................................. 125.2 Status Reports......................................................................................................................................125.3 Schedules.............................................................................................................................................126 Governance................................................................................................................................................136.1 Contacts................................................................................................................................................136.2 Escalation Matrix................................................................................................................................. 137 Annex 1 .........................................................................................................................................................................14Page 97 of 111«  co co oo tj- io in co co co1 Project OverviewMazars is a global audit, accounting and consulting group employing more than 15,000 professionals in 73 countries through member firms With head offices in France, Mazars is the 11th largest accounting firm in the world.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 815, "text": "4.3 Payment ScheduleBilling per MilestoneInvoice AmountProject Kickoff70,000 EurosPhaseO deliverable Signoff40,000 EurosPhasel Implementation SOW Signoff40,000 EurosPage 107 of 1115 Communication Plans5.1 Weekly MeetingsA weekly status meeting will be established by the Mazars Project Manager, with day and time mutually agreed upon with the MetricStream project Solutions Manager.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 816, "text": "TiVo will pay MetricStream in U.S. dollars within thirty days ( net 30 terms) o f receipt o f a correct invoice all undisputed charges and promptly notify MetricStream in writing o f any disputed amount.", "meta": {}, "annotation_approver": null, "labels": [[50, 61, "Payment Term"]]},
{"id": 817, "text": "In the event any such taxes are imposed upon and paid by MetricStream, TiVo shall reimburse MetricStream within 30 days o f receipt o f an invoice from MetricStream if, and only if, MetricStream has provided TiVo with all records documenting such payment as may be reasonably requested by TiVo and such records are sufficient for TiVo to have the full benefits o f such tax payments.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 818, "text": "HDS will pay such undisputed invoice within forty-five (45) days of receipt, and will have no further payment obligations with regard to this Agreement or the SOW, as applicable.", "meta": {}, "annotation_approver": null, "labels": [[44, 64, "Payment Term"]]},
{"id": 819, "text": "HDS will not be required to pay any invoice delivered more than one hundred and twenty (120) days after the charges, fees and/or expenses were incurred by HDS.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 820, "text": "Unless otherwise specified in the SOW, all undisputed payments will be due forty-five (450) days after HDS' receipt of Vendor’s invoice therefore4.3 Taxes.", "meta": {}, "annotation_approver": null, "labels": [[75, 96, "Payment Term"]]},
{"id": 821, "text": "If, as a result of such audit, HDS determines that Vendor has overcharged HDS, it will notify Vendor of the amount of such overcharge and Vendor will promptly pay to HDS the amount of the overcharge, plus interest calculated at rate of one and one-half percent (1,5%) per month from the date of receipt by Vendor of the overcharged amount until the date of payment to HDS.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 822, "text": "11.1 Vendor shall maintain insurance coverage, and on all certificates for coverage under general liability, automobile liability, employer’s liability, worker’s compensation, and any other coverages required under local law, shall:(i) name HDS as an “Additional Insured\" (or \"Loss Payee\" under All Risk Property insurance), including without limitation, as an insured with respect to third-party claims or actions made or brought directly against HDS or against HDS and Vendor as co­defendants and arising out of or in connection with this Agreement; (ii) be written as a primary policy not contributing with any other coverage which HDS may carry; and (iii) stipulate that HDS shall receive thirty (30) days’ prior written notice of any cancellation or reduction in coverage; provided that such cancellation or alteration shall not relieve Vendor of its continuing obligation to maintain insurance coverages in accordance with this Section.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 823, "text": "On or after the expiration of the Anniversary Notice, Licensor may invoice Customer the annual maintenance fee, which shall be paid in quarterly installments by Customer, with the first installment being due and payable within thirty (30) days of Customer’s receipt of Licensor’s invoice, if Customer has not notified Licensor of Customer’s intent not to extend or renew the maintenance and support services for that Maintenance Period.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 824, "text": "All undisputed invoices shall be paid in net 30 days of the receipt of such invoice by Lowe’s.", "meta": {}, "annotation_approver": null, "labels": [[45, 52, "Payment Term"]]},
{"id": 825, "text": "Should an audit reveal that any payment, claim or change order was not in conformity with the provisions of this Agreement or the invoice by which Licensor or its Authorized Reseller requested payment, then Customer will be entitled to (a) offset any excessive, unwarranted or misapplied payments against any currently due or future payments due under this Agreement, or (b) demand reimbursement to Customer of the excessive, unwarranted and/or misapplied payments, which reimbursement Licensor will make within twenty (20) days after receipt of the written demand from Customer.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 826, "text": "Subject to approval, Expenses shall be paid thirty (30) days upon receipt of invoice.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 827, "text": "All such payments shall be made by Customer within thirty (30) days of any termination of this Agreement, m the event of vrmmution.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 828, "text": "Customer will pay MelricStream in U S. dollars within thirty (30) days (net 30 terms) of receipt of a correct invoice all undisputed charges and promptly notify MetncSiream in writing of any disputed amount.", "meta": {}, "annotation_approver": null, "labels": [[54, 70, "Payment Term"]]},
{"id": 829, "text": "9.2 Payment Terms(a) Credit Suisse shall pay each invoice properly rendered in accordance with this Agreement and not in bona fide dispute within forty-five (45) days following the later of (x) receipt of the invoice, and (y) the date for payment specified below or as otherwise agreed in the Transaction Schedule:(i) License Fees.", "meta": {}, "annotation_approver": null, "labels": [[146, 166, "Payment Term"]]},
{"id": 830, "text": "(b) Notwithstanding the foregoing, Credit Suisse shall have the option of making the payment within ten (10) days from the date of receipt of a correct invoice and Contracting Party agrees that Credit Suisse shall be entitled to apply a 2% discount against such payment.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 831, "text": "Credit Suisse shall not be obligated to pay any invoice delivered by Contracting Party more than three (3) months after completion of the Services to which the invoice pertains.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 832, "text": "All such payments shall be made by Customer within thirty (30) days of any termination of this Agreement.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 833, "text": "Customer will pay MetricStream in U.S. dollars within 30 days (Net 30 terms) of receipt of a correct invoice all undisputed charges and promptly notify MetricStream in waiting of any disputed amount.", "meta": {}, "annotation_approver": null, "labels": [[54, 61, "Payment Term"]]},
{"id": 834, "text": "8.4 Payment of invoicesEach Valid Tax Invoice will, subject to clause 8.5, be payable by the 20th of the month following the month in which the invoice was received by the Department.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 835, "text": "Any dispute as to payment not resolved within 30 days will be referred for expert determination in accordance with clause 15.2.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 836, "text": "16.3 Termination by Service Provider(a) The Service Provider may terminate this Agreement by notice to the Department if the Department fails to pay any part of the Charges when due and payable and such failure is not remedied within 30 days of receiving notice of the failure, provided that such amount is:(i) overdue by 90 days;(ii) greater than $50,000; and(¡ii) not the subject of a Dispute between the parties.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 837, "text": "PositionSIGNED by MetricStream Inc.~£>U(/ W m Ç'_______SignatureBill Williams NameDirector of Corporate Affairs PositionMaster Agreement31Schedule 1: DefinitionsIn this Agreement, unless the context otherwise requires:Acceptance Date means the date that the Department issues an acceptance certificate for the System pursuant to paragraph 6.9 of Schedule 3 (Implementation);Agreement is described in clause 17.1 of the Base Agreement;AML/CFT Act means the Anti-Money Laundering and Countering Financing of Terrorism Act 2009; Annexure means:(a) any document physically attached, or annexed, to a Schedule and Identified as such; and(b) any document referenced in any Schedule or Annexure;Available or Availability means that the System is fully accessible to, usable by and able to process information for, all Users In accordance with the Specifications and otherwise in the manner required by this Agreement;Base Agreement means clauses 1 to 18 (inclusive) of, and Schedule 1 (Definitions) to, this Agreement;Change has the meaning given in Schedule 7 (Change Management);Change Procedure means the change control procedure set out in Schedule 7 (Change Management);Change Request means the written request relating to a proposed change by which the Department or the Service Provider may initiate the Change Procedure;Charges means the amount payable by the Department for the System and the Services, set out in Schedule 5 (Pricing);Commencement Date means the date this Agreement is signed by both parties (or, if two dates, the later date);Control means, in relation to the Service Provider, or any ultimate or intermediate holding company of the Service Provider, the power to:(a) manage, directly or indirectly, the operation of the business of; or(b) control, directly or indirectly, the composition of the board of directors or board of management of,the Service Provider or any ultimate or intermediate holding company, whether through the ownership of voting securities, by contract or otherwise and for these purposes “holding company” will have the same meaning as in section 5 of the Companies Act 1993;Data means all:(a) data constituted by information supplied to or collected by the Service Provider for the purpose of enabling the Service Provider to perform its obligations under this Agreement;Schedule 1 (Definitions)32(b) data, information, records and lists processed or collated by the Service Provider from or as a result of the performance by the Service Provider of its obligations under this Agreement;(c) databases and other compilations of data created by the Department or the Service Provider for the purposes of this Agreement; and(d) Information that establishes audit trails for data collated, processed, created and archived for the purposes of the performance of obligations under this Agreement;Department Environment means the Department s:(a) business, organisational, technical and commercial processes and procedures; and(b) information technology and telecommunications infrastructure and environment (including Software, hardware, systems and networks),as existing from time to time and interfacing with the System;Department Materials means all materials (including Software) existing at the date those materials are first used for the purposes of this Agreement, the Intellectual Property in which is vested in the Department or its licensor, including all adaptations, modifications and new versions of those materials made by the Service Provider, the Department or any third party during the Term;Developed Materials means all materials (including Software and Source Code) that are not Department Materials and are created or developed by the Service Provider (or any Subcontractor) for the purposes of this Agreement, including all adaptations, modifications and new versions of those materials;Disengagement Services means:(a) developing a detailed disengagement plan to assist the seamless migration of the Services to the Department or any successor service provider, and submitting that plan to the Department for its approval;(b) returning Data, Software, and Department Materials to the Department or to a successor service provider, as requested by the Department;(c) delivering Developed Materials to the Department or to a successor service provider, as requested by the Department; and(d) such other services as the Department and the Service Provider mutually agree upon to ensure an orderly and timely migration of the Services from the Service Provider to it or any successor service provider;Dispute has the meaning given to It by clause 15.1 of the Base Agreement;Documentation means all documentation and reports relating to the System, as are reasonably necessary for the Department to use, support, operate and obtain the full benefit of the System (including specifications, manuals, processes descriptions, methodologies, user guides, data models, system schematics and maps, database schema and file content descriptions, maintenance records, maintenance libraries, and procedures), and includes all documentation that must be provided by the Service Provider under this Agreement and has been, or will be, prepared or used by the Service Provider for the purpose of providing the Services;Document Finalisation Process has the meaning given to it In Schedule 9 (Document Finalisation Process)Schedule 1 (Definitions)33Force Majeure Event means an event beyond the reasonable control of either party which makes it impossible or illegal to perform, or prevents compliance with, or the performance of, that party’s obligations under this Agreement, excluding any event:(a) if, and to the extent that, the effect of that event could have been substantially prevented, avoided or mitigated by:(i) exercising a reasonable standard of care; or(ii) using information provided by the other party or available in the public domain;(b) for which the affected party is or was directly responsible;(c) constituted by the failure of a Subcontractor unless and to the extent that the Subcontractor was itself affected by an event which, if it occurred in relation to either party, would have been a Force Majeure Event; or(d) constituted by the insolvency of either party or lack of funds;Good Industry Practice means, in relation to the Service Provider’s performance of the Services, the exercise of the skill, diligence, prudence, foresight and judgement which would be expected from a highly skilled and experienced person engaged in the same type of undertaking under the same or similar circumstances, applying the standards and practices currently generally applied in the New Zealand technology industry;GST means goods and services tax payable under the Goods and Services Tax Act 1985;Implementation means the activities, functions and services of the Service Provider set out in Schedule 3 (Implementation);Implementation Milestone means each Implementation milestone set out in the Project Plan;Implementation Milestone Date means each due date for achievement of an Implementation Milestone, set out in the Project Plan;Implementation Period means the period starting on the date that the Verification Milestone is achieved and ending on the Acceptance Date;Initial Term means a period of five years from the Commencement Date;Insolvency Event means, in relation to the Service Provider:(a) the presentation of an application for its liquidation that is not discharged within 30 days of its filing or which is not demonstrated to the Department prior to the expiry of that 30 day period as being an application that is frivolous or vexatious;(b) any step taken in or toward the making of any compromise, proposal or deed of arrangement with all or some of its creditors;(c) the appointment of a liquidator, receiver, statutory manager, or similar official;(d) the suspension or threatened suspension of the payment of its debts;(e) cessation of a whole or any relevant part of its business; or(f) the enforcement of any security against the whole or a substantial part of its assets;Schedule 1 (Definitions)34Intellectual Property means copyright, trade mark, design, patent, semiconductor or circuit layout rights, trade or other proprietary rights or rights derivative of those rights as well as any other rights in intellectual property which are recognised or protected under Law;Key Personnel means those Personnel listed in paragraph 3.4 of Schedule 6 (Governance), as augmented or replaced from time to time in accordance with the terms of this Agreement, and Key Person means any person who is a member of the Key Personnel;Law means:(a) any statute, regulation, bylaw, ordinance or subordinate legislation in force from time to time to which either party is subject;(b) the common law and the law of equity as applicable to the parties from time to time;(c) any binding industry code, policy or standard enforceable by law; and(d) any applicable direction, policy, permission, consent, licence rule or order that is binding on either party and that is made or given by any governmental, legal or regulatory body having jurisdiction over either party or any of that party’s assets, resources or business,In any jurisdiction that is applicable to this Agreement;Objectives has the meaning given In clause 2.1 of the Base Agreement;Personnel includes employees, agents, officers and independent individual contractors;Problem has the meaning in paragraph 6.5 of Schedule 3 (Implementation);Professional Service Rates means the rates set out in paragraph 7 of Schedule 5 (Pricing);Project Plan means the operative document which sets out the plan for the conduct of Implementation, attached to Schedule 3 (Implementation);Relationship Manager has the meaning given in paragraph 2.1 of Schedule 6 (Governance)Requirements means the Department’s requirements for the System and the Services, set out in this Agreement (including Annexure A to Schedule 2 (Requirements)) and in the documents referenced by this Agreement, as amended from time to time in accordance with the Change Procedure;RFP means the request for proposals in relation to the implementation and support of the System, Issued by the Department on 23 October 2012;RFP Response means the Service Provider’s response to the RFP, as clarified and amended by subsequent correspondence or material (including questions and answers, whether provided in writing or at any Interview or presentation made to the Department) between the Department and the Service Provider prior to the Commencement Date;Services means any and all of the deliverables and services to be provided, and obligations to be performed, by the Service Provider under this Agreement, including Verification, Implementation, Support and Disengagement Services (if any);Service Credit means a credit to be applied against the Charges in the event of a Service Level Default, in accordance with Annexure A to Schedule 4 (Support);Service Credit Pool has the meaning in clause 2.7(c) of the Base Agreement;Schedule 1 (Definitions)35Service Level means a performance standard to be met by the Service Provider when performing Support, set out in Annexure A to Schedule 4 (Support);Service Level Default means a failure by the Service Provider to meet a Service Level;Service Provider Materials means all materials (including Software) that are:(a) not Developed Materials or Department Materials; and(b) existing at the date those materials are first used for the purposes of this Agreement,the Intellectual Property in which is vested in the Service Provider (or its licensor), including all adaptations, modifications and new versions of those materials;Software means the object code version of any software, database, or protocol, together with any updates, releases, versions, corrections, modifications, enhancements or developments and related Documentation;Source Code means, in relation to any Software, the human readable form of that Software and includes all documentation, algorithms, technical data, tools and any other materials necessary for a reasonably competent software developer to understand, modify and support that Software;Specifications means the Verification deliverables that describe the System;Subcontractor means any person to whom the Service Provider has subcontracted any part of its obligations under this Agreement and includes the employees and subcontractors of that person and like terms will be construed accordingly;Support means any and all of the support services to be provided, and obligations to be performed, by the Service Provider relating to the System during the Term, as set out in Schedule 4 (Support);System means the complete AML/CFT compliance monitoring and regulatory management system and associated deliverables to be provided by the Service Provider under this Agreement;Term means the Initial Term, and all Extended Terms (if any);User means any person using, or interacting with, the System, including Department Personnel;Verification means the mutually agreed upon verification activities, functions and services to be provided by the Service Provider to the Department as set out in Schedule 2 (Verification);Verification Milestone means the Department’s written acceptance, in its sole discretion, that the Specifications meet the Requirements;Verification Milestone Date means the due date for achievement of the Verification Milestone as set out in paragraph 7 of Schedule 2 (Verification); andVirus means any program code or programming instructions, or any thing or device, which may damage, interfere with, impair or otherwise adversely affect the operation of the System, prevent or hinder access to any program or data, or enable unauthorised access to any program or data, impair or disrupt the operation of any program or the reliability of any data (whether by re-arranging, altering or erasing the program or data in whole or part or otherwise), including malicious code, trojan horses, worms, spyware, malware, computer viruses, logic bombs, backdoors, disabling code and other similar things.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 838, "text": "4.6 Subject to paragraph 4.5, if the Service Provider fails to achieve the Implementation Milestone Date for the Acceptance Date the Service Provider will pay the Department $35,000 in liquidated damages for every month after the Implementation Milestone Date that an acceptance certificate is not issued in accordance with paragraph 6.9 of this Schedule 3 (Implementation).", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 839, "text": "Each party will have the right to terminate this Agreement or any individual Order Schedule if the other party fails to perform any material obligation under this Agreement or Order Schedule (including the obligation to pay license fees when due) and fails to cure such nonperformance within thirty (30) days following written notice of such failure.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 840, "text": "The circumstances under which the Source Code will be released from escrow are as follows:(1) Certus becomes insolvent or admits insolvency or admits a general inability to pay its debts as they become due; or(2) Certus files a petition for protection under the bankruptcy code of the United States, or an involuntary petition in bankruptcy is filed against Certus and is not dismissed within sixty (60) days thereafter; or(3) Certus or its successor in interest ceases to support the Software in breach of its obligations under the Maintenance and Support Addendum.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 841, "text": "The current rate for additional Professional Services is $1,800 per day, per person, plus travel time and costs, billed as incurred and payable net 30 days.", "meta": {}, "annotation_approver": null, "labels": [[148, 156, "Payment Term"]]},
{"id": 842, "text": "The Growth Rate for any year will be used to compute the License Fee Increase, if any, due for that year, according to the following table:Employee Growth RateLicense Fee Increase0 -  14.99%No License Fee Increase15% - 24.99%10%25% - 34.99%20%35% and above30%Certus will send an invoice to Mutual of Omaha promptly in the event of any License Fee Increase for a particular year, and Mutual of Omaha agrees to pay such invoice within thirty (30) days of receipt.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 843, "text": "NE 68175_________________________________Contact Phone: (402) 351-5097________________________________Except as provided above, Invoices are due and payable within thirty (30) days of Mutual of Omaha’s receipt of an accurate invoice.", "meta": {}, "annotation_approver": null, "labels": [[164, 180, "Payment Term"]]},
{"id": 844, "text": "Payment terms shall be net sixty (60) days from Buyer's receipt of Seller's correctly ¡sented invoice, which includes this order number sent to the correct billing address.", "meta": {}, "annotation_approver": null, "labels": [[27, 42, "Payment Term"]]},
{"id": 845, "text": "Payment periods d cash discount periods will be computed from either the date of delivery or acceptance of the Items lered or the date of receipt of correct and proper invoices prepared in accordance with the terms of the ler, whichever is later.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 846, "text": "The Pharmacy shall pay Contractor for services rendered, after submission of completed nurses notes/visit records, within thirty (30) days of receipt of invoice, at the rates specified herein.", "meta": {}, "annotation_approver": null, "labels": [[122, 138, "Payment Term"]]},
{"id": 847, "text": "The Pharmacy understands that the fees associated with the 340B eligible claims will be invoiced on behalf of the Covered Entity for the time period starting· from the date of service indicated in item l to the go-live date of the Sentrex software and be due upon receipt of the invoice per the agreed upon payment terms.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 848, "text": "Payments for Covered Services from WPS to Diplomat shall be remitted, subject to receipt of funds from applicable Payors, twice each month within thirty (30) days of an electronically submitted claim unless state or any law mandates a lesser period of time.", "meta": {}, "annotation_approver": null, "labels": [[146, 162, "Payment Term"]]},
{"id": 849, "text": "In no event shall payment be required to be made hereunder by WPS pursuant to a claim received more than one hundred eighty (180) days from ------- -~---tH.(}-date-.Se1'¥iGes--al'e---1'€ndered;----UnlesS---Diplonutt---JJ0tifles----WPS-m--W!", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 850, "text": "Payments for Covered Services provided by Diplomat shall be made within forty-five (45) days when applicable claims are adjudicated electronically via WPS's Diplomat management system and sixty (60) days when claims are submitted to WPS on paper claims submitted in the proper, Clean Claim format as defined by the State of Michigan.", "meta": {}, "annotation_approver": null, "labels": [[72, 92, "Payment Term"], [188, 203, "Payment Term"]]},
{"id": 851, "text": "Failure to pay undisputed amounts within sixty (60) days specified herein shall result in interest accruing on the unpaid account at a rate of ten percent (10%) per annum from the date payment is due hereunder until payment in full is received by Diplomat.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 852, "text": "Finally, all payments to Diplomat shall be accompanied by an EOB (Explanation of Benefits) document within three (3) days of such payment.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 853, "text": "In the event of an overpayment or underpayment to Diplomat by WPS, either party shall notify the other of such e1rnneous payment within ten (10) business days of becoming aware of such e11·oneous payment and shall return or arrange the return of such erroneous payment to the other pmty.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 854, "text": "No interest shall be due on such erroneous payments provided repayment occurs within thirty (30) days from date of discovery.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 855, "text": "WPS shall be permitted to obtain reimbursement for overpayments made to Diplomat by offsetting the amount of such overpayment against future payments due or obtaining reimbursement from Diplomat of such overpayments, however such offsetting shall not occur until after a minimum twenty (20) day cure period and such offset is adequately identified on the EOB provided that includes the offset to payment.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 856, "text": "Diplomat shall not impose a surcharge, additional fees, interest or any other additional premiums over and above the applicable ---- ----------- ------------Co-paym@l----as--cGmmuniGat€d--~----th€--4l-1!ine-adj-:ooicatie~reGe--&sing.-------Diplomat shall bill Member for Co-payments and Deductibles and if the balance of the outstanding amount due for Covered Services provided by Diplomat is not paid to Diplomat in a timely manner, provided Diplomat shall have first exhausted all commercially reasonable effmis to obtain payment from Payor, and provided that Diplomat has given 30 days prior written notice to Member then in such event Diplomat may institute proceedings, at law or in equity against Member, to recover reimbursement for Diplomat's services.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 857, "text": "Payment shall be made within thirty (30) days following the end of each measurement period in default.", "meta": {}, "annotation_approver": null, "labels": [[29, 45, "Payment Term"]]},
{"id": 858, "text": "Such quarterly reconciliations, along with any related inventory reconciliation and reimbursement payments as described below shall occur within ten (10) days following the end of such quarter during the term of this Agreement (e.g., by January 10, April 10, July 10 and October 10, respectively).", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 859, "text": "The first payment due Hospital under the terms of this Section 6.1 shall be delayed until the later of: (i) six (6) weeks following the Effective Date of this Agreement; or (ii) until an executed Contract Administrator Agreement is in place and effective.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 860, "text": "Suite 205-208 Ontario, CA 91761 NABP: 057476-1-NPI: 1659479632 DEA Number: FDl 746835 Contact Name: Sandra Barbosa Phone: (909) 881-1728 Fax: (909) 882-3621 Email: sbarbosa1ii'diplomat.is Exhibit C Fee Schedule Dispensing Fee: The Dispensing Fee per Qualified Dispensed Drug prescription: First ycar of Initial Tenn $220.00 $750.00 Hepatitis C Specialty l\\1edications Second year of Initial Term $250.00 $950.00 Hepatitis C Specialty Medications Third year of Initial Term $280.00 $1150.00 Hepatitis C Specialty Medications Exhibit D Supplier(s) McKesson Item Replenishment Frequency Wholesaler Out-of Stock Drugs (005) Slow-Movers Slow-Moving PARTIAL PACKAGES Model Dispensing Fee (if applicable} Exhibit E Operational Decision Matrix DECISION MATRIX Decision Point Parameter Most Frequently Used Parameter On the mutually agreed upon schedule, and if applicable contingent upon CE payment confirmation, third party administrator shall 2x per month, lx per order, for delivery to week, 3x per week, 2x 3x per week Pharmacy, all drugs per week.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 861, "text": "CIiis-Vs Include or exclude include or exclude included INCLUDE these drugs In Specialty contract pharmacy • Clls require if applicable, Included if applicable, unique to Clls the use of 222 forms; EXCLUDE In-house pharmacy or Excluded each agreement order as usual Item Invoicing Payment Terms Contract Term Decision Point Frequency with which pharmacy Is Invoiced on behalf of the hospital Within ___ _ number of days from Invoice date, Pharmacy Parameter ht & 15th shall remit payment II of calendar days thereof by electronic funds transfer to Covered Entity, Years Most Frequently Used Parameter unique to each agreement, in-house pharmacy default = 30 days 1-Syears Please Define ht & 15th of each month 30 DAYS ) I JS) JV", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 862, "text": "Hospital will pay invoices within thirty (30) days of invoice e. o~pitaJ's obligation to pay for Products is absolute, unc-onditional and not subje ' re uttion>.", "meta": {}, "annotation_approver": null, "labels": [[34, 50, "Payment Term"]]},
{"id": 863, "text": "If C\\1stomer re ms more than 3% of its Rx Net ·Purchases (defined as Hospital's total purchases from Envoy less returns, credits, rebates, Price of Goods adJustments, late payment fees and similar Hems) or 3% of its non-Rx Net Purchases in any month, Envoy may assess Hospital an additional restoc ing fee, adjust its Price of Goods, or both.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 864, "text": "V. PAYMENT TO PROVIDER A. TriWest will use best efforts to process Clean Claims within thirty (30) days of receipt and will make payment directly to Provider for Covered Services rendered by Provider to TRICARE Beneficiaries in accordance with the Reimbursement Rates set forth in Exhibit 1.", "meta": {}, "annotation_approver": null, "labels": [[87, 103, "Payment Term"]]},
{"id": 865, "text": "If Provider still believes that TriWest' s determination of payment or non-payment is inconcct and/or has information that was not previously available for review when submitted to TriWest, Provider may direct a second request for review in writing to TriWest within sixty (60) days of receipt of the prior determination.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 866, "text": "Invoices are due NET 30 Client agrees to pay CareWorks a late charge of one and one half percent (1J4%) per month or the maximum lawful rate, whichever is less, for all amounts not paid within thirty (45) days of receipt of invoice.", "meta": {}, "annotation_approver": null, "labels": [[17, 23, "Payment Term"]]},
{"id": 867, "text": "CareWorks may discontinue Services if Client fails to pay any sum due within sixty (60) days after receipt of invoice if, after five (5) days notice by CareWorks of Client's failure to pay, such failure to pay has not been cured.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 868, "text": "With the exception of fraud or as otherwise required by law or regulatory agencies, all requests for correction of claim payment(s) or CHC-KSMO-CON-I26-09.07_Ancillary_all Page 4 of 15 recovery by Provider, Health Plan or Payor shall be limited to three hundred sixty-five (365) days from the date Health Plan or Payor paid the claim.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 869, "text": "Coventry Company shall use best efforts to require Payors to pay Provider within thirty (30) days receipt of a claim that is accurate, complete, and otherwise in accordance with this section.", "meta": {}, "annotation_approver": null, "labels": [[81, 97, "Payment Term"]]},
{"id": 870, "text": "or if this l...case or the estate of Tenant hereunder is transferred or passed to or devolves upon any other person or corporation, or if Tenant shall default in fulfilling any of the covenants of this Lease, other than the covenant for the payment of Fixed Rent or Additional Rent, or if the Premises becomes vacant or deserted, Landlord may give Tenant ten ( 10) days' notice of its intention to end lhe Term of this Lease, and thereupon at the expiration of said ten ( I 0) day period (if said condition which was the basis of said notice shall continue to exist), this Lease shall expire as fully and completely as if that day was the date herein definitely fixed for the expiration of the Tenn and Tenant will quit and surrender the Premises to Landlord.", "meta": {}, "annotation_approver": null, "labels": []},
{"id": 871, "text": "(b) If Tenant shall default in the payment of Fixed Rent reserved hereunder, or any item of Additional Rent, or any part of either or in making any other payment herein provided for and such default is not cured within ten ( 10) days of Landlord's notice to Tenant, or if noti~ pursuant to subparagraph (a) of this Section 26 shall have been given and if the con<lition which was the basis of said notice shall exist at the expiration of said ten ( I 0) day period (subject to the exception for conditions the nature of which aren't reasonably curable within such ten (10) day period), Landlord may immediately, or at any time thereafter, re-enter the Premises and remove all persons and all or any property therefrom, either by summary dispossess proceedings or by any suitable action or proceeding at law, or by force or otherwise, without being liable to indictment, prosecution or damages therefor, and re-possess and enjoy the Premises together with all additions, alterations and improvements.", "meta": {}, "annotation_approver": null, "labels": []}]}
